test/demoSystem/soap/action.xml

<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/">
    <SOAP-ENV:Header>
        <xr:relay SOAP-ENV:actor="http://xdaq.web.cern.ch/xdaq/xsd/2004/XRelay-10" xmlns:xr="http://xdaq.web.cern.ch/xdaq/xsd/2004/XRelay-10">
            <xr:to url="APPLICATION_URL" urn="urn:xdaq-application:lid=XDAQ_LID"/>
        </xr:relay>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <xdaq:REQUESTED_ACTION xmlns:xdaq="urn:xdaq-soap:3.0">
        </xdaq:REQUESTED_ACTION>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
